FemDesign.Loads.LineTemperatureLoad.Edge
Edge defining the geometry of the load

FemDesign.Loads.LineTemperatureLoad.Direction
Direction of load.

FemDesign.Loads.LineTemperatureLoad.Normal
Optional. Ambiguous what this does.

FemDesign.Loads.LineTemperatureLoad._topBotLocVal
Field

FemDesign.Loads.LineTemperatureLoad.TopBotLocVal
Top bottom value can be a list of 1 or 2 items. 1 item defines a uniform line load, 2 items defines a variable line load.

FemDesign.Loads.LineTemperatureLoad.#ctor
Parameterless constructor for serialization

FemDesign.Loads.LineTemperatureLoad.#ctor(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,System.Collections.Generic.List{FemDesign.Loads.TopBotLocationValue},FemDesign.Loads.LoadCase,System.String)
Construct a uniform or variable line temperature load
edge: Underlying edge of line load. Line or Arc.
direction: Directio of load.
topBotLocVal: 1 or 2 top bottom location values